<template>
  <div>
    <h5>净资产收益率</h5>
    <ve-histogram :data="chartData"></ve-histogram>
  </div>
</template>

<script>
  export default {
    data () {
      return {
        chartData: {
          columns: ['日期', '格力电器', '五粮液', '美的集团', '中兴通讯'],
          rows: [
            // { '日期': '2010.03', '格力电器': 3.03, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2010.06', '格力电器': 14.85, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2010.09', '格力电器': 24.14, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2010.12', '格力电器': 32.04, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2011.03', '格力电器': 6.56, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2011.06', '格力电器': 15.06, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2011.09', '格力电器': 23.42, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2011.12', '格力电器': 29.74, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2012.03', '格力电器': 5.33, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2012.06', '格力电器': 12.93, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2012.09', '格力电器': 21.59, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2012.12', '格力电器': 27.59, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2013.03', '格力电器': 4.7, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2013.06', '格力电器': 14.5, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2013.09', '格力电器': 24.2, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2013.12', '格力电器': 31.4, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2014.03', '格力电器': 6.13, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2014.06', '格力电器': 15.98, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2014.09', '格力电器': 24.67, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            // { '日期': '2014.12', '格力电器': 32.06, '五粮液': 0 ,'美的集团':0, '中兴通讯':0},
            { '日期': '2015.03', '格力电器': 5.9, '五粮液': 5.29 ,'美的集团':7.78, '中兴通讯':2.67},
            { '日期': '2015.06', '格力电器': 13.9, '五粮液': 8.15 ,'美的集团':18.04, '中兴通讯':4.71},
            { '日期': '2015.09', '格力电器': 22.15, '五粮液': 11 ,'美的集团':23.1, '中兴通讯':7.58},
            { '日期': '2015.12', '格力电器': 26.37, '五粮液': 14.25 ,'美的集团':25.8, '中兴通讯':8.23},
            { '日期': '2016.03', '格力电器': 6.23, '五粮液': 6.28 ,'美的集团':7.25, '中兴通讯':2.43},
            { '日期': '2016.06', '格力电器': 14.26, '五粮液': 8.8 ,'美的集团':17.16, '中兴通讯':4.4},
            { '日期': '2016.09', '格力电器': 22.57, '五粮液': 11.24 ,'美的集团':21.94, '中兴通讯':6.98},
            { '日期': '2016.12', '格力电器': 28.63, '五粮液': 14.44 ,'美的集团':24, '中兴通讯':-6.6},
            { '日期': '2017.03', '格力电器': 6.94, '五粮液': 7.09 ,'美的集团':6.6, '中兴通讯':3.32},
            { '日期': '2017.06', '格力电器': 18.02, '五粮液': 10.22 ,'美的集团':16.3, '中兴通讯':6},
            { '日期': '2017.09', '格力电器': 26.37, '五粮液': 13.76 ,'美的集团':21.06, '中兴通讯':9.7},
            { '日期': '2017.12', '格力电器': 34.15, '五粮液': 18.14 ,'美的集团':23.44, '中兴通讯':11.15},
            { '日期': '2018.03', '格力电器': 7.87, '五粮液': 8.53 ,'美的集团':6.63, '中兴通讯':4.26},
            { '日期': '2018.06', '格力电器': 16.35, '五粮液': 12.4 ,'美的集团':16.3, '中兴通讯':-26.39},
            { '日期': '2018.09', '格力电器': 24.36, '五粮液': 15.9 ,'美的集团':21.6, '中兴通讯':-23.86},
            { '日期': '2018.12', '格力电器': 28.69, '五粮液': 21.8 ,'美的集团':24.35, '中兴通讯':-23.96},
            { '日期': '2019.03', '格力电器': 6.07, '五粮液': 9.26 ,'美的集团':6.8, '中兴通讯':2.9},          
            { '日期': '2019.06', '格力电器': 14.84, '五粮液': 14.1 ,'美的集团':16.4, '中兴通讯':4.8},          
            { '日期': '2019.09', '格力电器': 21.96, '五粮液': 18.07 ,'美的集团':21.7, '中兴通讯':12.17},          
            { '日期': '2019.12', '格力电器': 22.42, '五粮液': 23.42 ,'美的集团':23.8, '中兴通讯':14.67},          
            { '日期': '2020.03', '格力电器': 1.38, '五粮液': 9.4 ,'美的集团':4.54, '中兴通讯':1.89},
            { '日期': '2020.06', '格力电器': 5.6, '五粮液': 14.17,'美的集团':13.27, '中兴通讯':4.51 }
          ]
        }
      }
    }
  }
</script>